# Taps
tap 'railwaycat/emacsmacport'
tap 'romkatv/gitstatus'

# Core utilities
# TODO: install other azure CLIs too? put this in repo-specific `script/bootstrap`?
brew 'azcopy'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'fd'
brew 'git'
brew 'gnu-sed'
brew 'htop'
brew 'jq'
brew 'k9s'
# TODO: force this to overwrite link because docker also installs `kubectl`
brew 'kubernetes-cli'
brew 'mysql-client@5.7'
brew 'pstree'
brew 'ripgrep'
brew 'romkatv/gitstatus/gitstatus'
brew 'rust-analyzer'
brew 'stow'
brew 'terraform'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'z'

# Languages
brew 'chruby'
brew 'go'
brew 'ruby-install'
brew 'shellcheck'

# Editors
brew 'railwaycat/emacsmacport/emacs-mac', args: ['with-modules']

# Fonts
brew 'freetype'

# Cask stuff
cask 'docker'
cask 'flycut'
cask 'iterm2'
cask 'rectangle'
